------------------------------------------------
-- AiGENT(Monitor) 配置文件
------------------------------------------------

------------------------------------------------
-- 时定时任务配置：单位秒，0 代表不触发定时定时任务
------------------------------------------------

-- [定时任务] AGENT进程守护时间间隔
timedTaskAgentDaemon = 10

-- [定时任务] 三方软件进程守护时间间隔
timedTaskProgramDaemon = 10

-- [定时任务] 和服务端数据通信时间间隔
timedTaskPingConnect = 3

-- [定时任务] 数据上报时间间隔
timedTaskDataReport = 0

-- [定时任务] 数据采集时间间隔
timedTaskDataCollect = 0

------------------------------------------------
-- 服务端参数配置
------------------------------------------------

serverAddr = "10.11.35.211:20210"
dataPath = "/home/.AiGent"
